//this file is used for complete the remainder function
/*******************************************************************************
            Copyright (C), 2017, GoerTek Technology Co., Ltd.
*******************************************************************************/
/**
  *  @defgroup	remainder module name
  *  @brief 	remainder
  *  @file 		remainder
  *  @author 	func
  *  @version 	1.0
  *  @date    	2017/8/19
  *  @{
  *//*
  *  FileName      : remainder
  *  Description   : 用于两个整型变量求余的头文件，里面放置相关功能函数GetR-
                     emainder()
  *  FunctionList  :
              		GetRemainder
  * History        :
  * 1.Date         : 2017/8/19
  *    Author      : func
  *    Modification: Created file
*******************************************************************************/

/*----------------------------------------------*
 * Include File                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * External Declaration                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Extern Prototype                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Internal Declaration                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Globle Variables                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Module Variables                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Const Defination                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Micro Defination                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * Function Declaration                         *
 *----------------------------------------------*/


/******************************************************************************/
/** 用于两个整型变量求余，num_first为被除数，num_second为除数
  *
  * @param[in] num_second
  *
  * @return
  *
  * @note
  *
  *//*
  * History        :
  * 1.Date         : 2017/8/19
  *   Author       : func
  *   Modification : Created function

*******************************************************************************/
int GetRemainder( int num_first, int num_second )
{
    int num_remainder;

    num_remainder = num_first % num_second;
    return num_remainder;
}
